In [1]:
import pandas as pd

In [5]:
import numpy as np

In [8]:
df = pd.DataFrame([
    [1,2,3],
    [3,4,6],
    [78,8,9]
])
df

    0  1  2
0   1  2  3
1   3  4  6
2  78  8  9

In [11]:
df.index =['a','b','c']

In [14]:
df = pd.DataFrame([
    [1,2,3],
    [3,4,6],
    [78,8,9]
])
df

    0  1  2
0   1  2  3
1   3  4  6
2  78  8  9

In [15]:
df.index =[1,3,5]

In [16]:
df

    0  1  2
1   1  2  3
3   3  4  6
5  78  8  9

In [17]:
a = [1,23,3,5]

In [18]:
a.index(5)

3

In [20]:
df

    0  1  2
1   1  2  3
3   3  4  6
5  78  8  9

In [19]:
# i  index  位置索引
df.iloc[[0,2],[0]]

    0
1   1
5  78

In [6]:
arry = np.array([
    [1,2,3],
    [3,4,6],
    [78,8,9]
])
arry

array([[ 1,  2,  3],
       [ 3,  4,  6],
       [78,  8,  9]])

In [7]:
pd.DataFrame(arry)

    0  1  2
0   1  2  3
1   3  4  6
2  78  8  9

In [71]:
students = pd.DataFrame({"001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},
 "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}
 }).T
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

In [72]:
a = students.iloc[:,1:].mean(axis=1).to_frame('mean_score')
a

    mean_score
001  90.666667
002  92.333333
003  85.333333
004  87.666667
005  92.666667
006  87.333333

In [36]:
students.iloc[:,1:].mean(axis=1).map(get_grade)

001     A
002     A
003    B+
004    B+
005     A
006    B+
dtype: object

In [54]:
b = a['mean_score'].tolist()

In [76]:
c =[]
for grade in a['mean_score']:
    print(grade,get_grade(grade))
    c.append(get_grade(grade))

90.66666666666667 A
92.33333333333333 A
85.33333333333333 B+
87.66666666666667 B+
92.66666666666667 A
87.33333333333333 B+

In [ ]:
# 5000  a= [] 

# 条件 A
# b= []
# for x  in a:
#     if 条件 A:
#         b.append(x)
        
# b

In [74]:
grade

87.33333333333333

In [75]:
get_grade(grade)

'B+'

In [62]:
b = []
for grade in a['mean_score']:
    b.append(get_grade(grade))
b

['A', 'A', 'B+', 'B+', 'A', 'B+']

In [68]:
students['c'] =b
students

     姓名 考试1 考试2 考试3   c
001  小陈  85  95  92   A
002  小李  91  92  94   A
003  小王  86  81  89  B+
004  小张  79  89  95  B+
005  小赵  96  91  91   A
006  小周  81  89  92  B+

In [ ]:
[] # 列表 容器 收集 元素 很多个

In [64]:
a = ['r','b','g','r','w','r']
a

['r', 'b', 'g', 'r', 'w', 'r']

In [ ]:
b =['r','r','r']

In [ ]:
[]

In [45]:
grade =90.66666666666667

In [46]:
get_grade(grade)

'A'

In [33]:
a['mean_score'].map(get_grade)

001     A
002     A
003    B+
004    B+
005     A
006    B+
Name: mean_score, dtype: object

In [32]:
def get_grade(average_score):
    if average_score >= 95:
        return "A+"
    elif average_score >= 90:
        return "A"
    elif average_score >= 85:
        return "B+"
    elif average_score >= 80:
        return "B"
    elif average_score >= 75:
        return "C+"
    else:
        return "C"